app/controllers/users_controller.rb

SELECT  `users`.`id`, `users`.`name`, `users`.`email` FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.select(:id,:name, :email).find_by(id: params[:id])

SELECT  `users`.`id`, `users`.`name`, `users`.`email` FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.select(:id,:name, :email).find_by(id: params[:id])